app/controllers/experiences_controller.rb

SELECT "experiences".* FROM "experiences"
---
	def index
		@experiences = Experience.all

SELECT  "experiences".* FROM "experiences" WHERE "experiences"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@experience = Experience.find(params[:id])

INSERT INTO "experiences" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
	def create
      @experience = Experience.new(experience_params)
	  @experience.save