app/controllers/parks_controller.rb

	def show
		@park = Park.find(params[:id])
---
SELECT  "parks".* FROM "parks" WHERE "parks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def edit
		@park = Park.find(params[:id])
---
SELECT  "parks".* FROM "parks" WHERE "parks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
      @park = Park.find(params[:id])
	  @park.update(park_params)
---
SELECT  "parks".* FROM "parks" WHERE "parks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "parks" SET "name" = ?, "city" = ? WHERE "parks"."id" = ?  [["name", "Bryant Park"], ["city", "Manhattan"], ["id", 3]]