app/controllers/visitors_controller.rb

SELECT  "visitors".* FROM "visitors" WHERE "visitors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@visitor = Visitor.find(params[:id])

INSERT INTO "visitors" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Leslie"], ["last_name", "Gonzalez"], ["created_at", "2021-06-25 02:03:39.114617"], ["updated_at", "2021-06-25 02:03:39.114617"]]
---
	def create
      @visitor = Visitor.new(visitor_params)
	  @visitor.save